Repository: pavello06/BSUIR-Schedule
Catalog: lib/core/l10n/app_*.arb
Languages: ru

# courseNumber
source: {number} course
ru: {number} курс

# schedule_weekNumber
source: {number} week
ru: {number} неделя

# schedule_info
source: Information
ru: Информация

# schedule_faculty
source: Faculty: {faculty}
ru: Факультет: {faculty}

# schedule_speciality
source: Speciality: {speciality}
ru: Специальность: {speciality}

# schedule_course
source: Course: {course}
ru: Курс: {course}

# schedule_educationForm
source: Education form: {educationForm}
ru: Форма обучения: {educationForm}

# schedule_specialityCode
source: Speciality code: {specialityCode}
ru: Код специальности: {specialityCode}

# schedule_termExist
source: Semester: from {startDate} to {endDate}
ru: Семестр: с {startDate} по {endDate}

# schedule_sessionExist
source: Session: from {startDate} to {endDate}
ru: Сессия: с {startDate} по {endDate}

# schedule_examsExist
source: Exams: added
ru: Экзамены: добавлено

# schedule_examsNotExist
source: Exams: not added
ru: Экзамены: не добавлено

# schedule_degree
source: Degree: {degree}
ru: Степень: {degree}

# schedule_rank
source: Rank: {rank}
ru: Ранг: {rank}

# schedules_numSubGroup
source: subgr. {number}
ru: подгр. {number}

source: My schedules
ru: Мои расписания

# savedSchedulesEmpty
source: You haven't added any schedules yet
ru: Вы не добавили ещё ни одного расписания

# addingSchedule
source: Adding a schedule
ru: Добавление расписания

source: Groups
ru: Группы

source: Teachers
ru: Преподаватели

source: Search
ru: Поиск

source: course
ru: курс

# foundedGroups
source: {count, plural, =0{{count} groups found} one{{count} group found} other{{count} groups found}}
ru: {count, plural, =0{Найдено {count} групп} one{Найдена {count} группа} few{Найдено {count} группы} many{Найдено {count} групп} other{Найдено {count} групп}}

# foundedTeachers
source: {count, plural, =0{{count} teachers found} one{{count} teacher found} other{{count} teachers found}}
ru: {count, plural, =0{Найдено {count} преподавателей} one{Найден {count} преподаватель} few{Найдено {count} преподавателя} many{Найдено {count} преподавателей} other{Найдено {count} преподавателей}}

# searchEmpty
source: Couldn't load schedule Pull down to update
ru: Не удалось загрузить расписание Потяните вниз, чтобы обновить

# searchSuccess
source: The data has been uploaded
ru: Данные загружены

# searchError
source: The data has not been uploaded
ru: Данные не загружены
